# ####################################################################

#  Created by Genus(TM) Synthesis Solution 25.10-p002_1 on Sat Mar 28 12:25:13 +07 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design sha256

create_clock -name "i_clk" -period 4.0 -waveform {0.0 2.0} [get_ports i_clk]
set_load -pin_load 0.2 [get_ports o_done]
set_load -pin_load 0.2 [get_ports {o_data[31]}]
set_load -pin_load 0.2 [get_ports {o_data[30]}]
set_load -pin_load 0.2 [get_ports {o_data[29]}]
set_load -pin_load 0.2 [get_ports {o_data[28]}]
set_load -pin_load 0.2 [get_ports {o_data[27]}]
set_load -pin_load 0.2 [get_ports {o_data[26]}]
set_load -pin_load 0.2 [get_ports {o_data[25]}]
set_load -pin_load 0.2 [get_ports {o_data[24]}]
set_load -pin_load 0.2 [get_ports {o_data[23]}]
set_load -pin_load 0.2 [get_ports {o_data[22]}]
set_load -pin_load 0.2 [get_ports {o_data[21]}]
set_load -pin_load 0.2 [get_ports {o_data[20]}]
set_load -pin_load 0.2 [get_ports {o_data[19]}]
set_load -pin_load 0.2 [get_ports {o_data[18]}]
set_load -pin_load 0.2 [get_ports {o_data[17]}]
set_load -pin_load 0.2 [get_ports {o_data[16]}]
set_load -pin_load 0.2 [get_ports {o_data[15]}]
set_load -pin_load 0.2 [get_ports {o_data[14]}]
set_load -pin_load 0.2 [get_ports {o_data[13]}]
set_load -pin_load 0.2 [get_ports {o_data[12]}]
set_load -pin_load 0.2 [get_ports {o_data[11]}]
set_load -pin_load 0.2 [get_ports {o_data[10]}]
set_load -pin_load 0.2 [get_ports {o_data[9]}]
set_load -pin_load 0.2 [get_ports {o_data[8]}]
set_load -pin_load 0.2 [get_ports {o_data[7]}]
set_load -pin_load 0.2 [get_ports {o_data[6]}]
set_load -pin_load 0.2 [get_ports {o_data[5]}]
set_load -pin_load 0.2 [get_ports {o_data[4]}]
set_load -pin_load 0.2 [get_ports {o_data[3]}]
set_load -pin_load 0.2 [get_ports {o_data[2]}]
set_load -pin_load 0.2 [get_ports {o_data[1]}]
set_load -pin_load 0.2 [get_ports {o_data[0]}]
set_load -pin_load 0.2 [get_ports {o_read[2]}]
set_load -pin_load 0.2 [get_ports {o_read[1]}]
set_load -pin_load 0.2 [get_ports {o_read[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports i_rst_n]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports i_enable]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[31]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[30]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[29]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[28]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[27]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[26]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[25]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[24]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[23]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[22]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[21]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[20]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[19]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[18]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[17]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[16]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[15]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[14]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[13]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[12]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[11]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[10]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[9]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[8]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[7]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[6]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[5]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[4]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[3]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[2]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[1]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_data[0]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_n[7]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_n[6]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_n[5]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_n[4]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_n[3]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_n[2]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_n[1]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_n[0]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[8]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[7]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[6]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[5]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[4]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[3]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[2]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[1]}]
set_input_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {i_miss[0]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports o_done]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[31]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[30]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[29]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[28]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[27]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[26]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[25]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[24]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[23]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[22]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[21]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[20]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[19]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[18]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[17]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[16]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[15]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[14]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[13]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[12]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[11]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[10]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[9]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[8]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[7]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[6]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[5]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[4]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[3]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[2]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[1]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_data[0]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_read[2]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_read[1]}]
set_output_delay -clock [get_clocks i_clk] -add_delay -max 1.0 [get_ports {o_read[0]}]
set_input_transition 0.1 [get_ports i_clk]
set_input_transition 0.1 [get_ports i_rst_n]
set_input_transition 0.1 [get_ports i_enable]
set_input_transition 0.1 [get_ports {i_data[31]}]
set_input_transition 0.1 [get_ports {i_data[30]}]
set_input_transition 0.1 [get_ports {i_data[29]}]
set_input_transition 0.1 [get_ports {i_data[28]}]
set_input_transition 0.1 [get_ports {i_data[27]}]
set_input_transition 0.1 [get_ports {i_data[26]}]
set_input_transition 0.1 [get_ports {i_data[25]}]
set_input_transition 0.1 [get_ports {i_data[24]}]
set_input_transition 0.1 [get_ports {i_data[23]}]
set_input_transition 0.1 [get_ports {i_data[22]}]
set_input_transition 0.1 [get_ports {i_data[21]}]
set_input_transition 0.1 [get_ports {i_data[20]}]
set_input_transition 0.1 [get_ports {i_data[19]}]
set_input_transition 0.1 [get_ports {i_data[18]}]
set_input_transition 0.1 [get_ports {i_data[17]}]
set_input_transition 0.1 [get_ports {i_data[16]}]
set_input_transition 0.1 [get_ports {i_data[15]}]
set_input_transition 0.1 [get_ports {i_data[14]}]
set_input_transition 0.1 [get_ports {i_data[13]}]
set_input_transition 0.1 [get_ports {i_data[12]}]
set_input_transition 0.1 [get_ports {i_data[11]}]
set_input_transition 0.1 [get_ports {i_data[10]}]
set_input_transition 0.1 [get_ports {i_data[9]}]
set_input_transition 0.1 [get_ports {i_data[8]}]
set_input_transition 0.1 [get_ports {i_data[7]}]
set_input_transition 0.1 [get_ports {i_data[6]}]
set_input_transition 0.1 [get_ports {i_data[5]}]
set_input_transition 0.1 [get_ports {i_data[4]}]
set_input_transition 0.1 [get_ports {i_data[3]}]
set_input_transition 0.1 [get_ports {i_data[2]}]
set_input_transition 0.1 [get_ports {i_data[1]}]
set_input_transition 0.1 [get_ports {i_data[0]}]
set_input_transition 0.1 [get_ports {i_n[7]}]
set_input_transition 0.1 [get_ports {i_n[6]}]
set_input_transition 0.1 [get_ports {i_n[5]}]
set_input_transition 0.1 [get_ports {i_n[4]}]
set_input_transition 0.1 [get_ports {i_n[3]}]
set_input_transition 0.1 [get_ports {i_n[2]}]
set_input_transition 0.1 [get_ports {i_n[1]}]
set_input_transition 0.1 [get_ports {i_n[0]}]
set_input_transition 0.1 [get_ports {i_miss[8]}]
set_input_transition 0.1 [get_ports {i_miss[7]}]
set_input_transition 0.1 [get_ports {i_miss[6]}]
set_input_transition 0.1 [get_ports {i_miss[5]}]
set_input_transition 0.1 [get_ports {i_miss[4]}]
set_input_transition 0.1 [get_ports {i_miss[3]}]
set_input_transition 0.1 [get_ports {i_miss[2]}]
set_input_transition 0.1 [get_ports {i_miss[1]}]
set_input_transition 0.1 [get_ports {i_miss[0]}]
set_wire_load_mode "enclosed"
